package com.dschepkin.javaCore;

public class Note {
    /**
     *
     * List.of()                - создает неизменяемую коллекцию
     * new ArrayList() <=> Arrays.asList("1","2" )  - изменяемая, но нельзя удалять и добавлять (размер неизменный)
     *
     * foreach - нельзя удалять или добавлять элементы в коллекцию. Только для чтение
     *      для изменения используется итератор
     *
     * входящий параметр (ArrayList) нельзя изменять, а надо создавать новый объект (ArrayList)
     */


}
